using System;
using System.Linq;

// Напишете програма, която намира максималната подредица от нарастващи елементи в масив.
// Последователни
// 
// Вход                         Изход
// 3 2 3 4 2 2 4            	2 3 4

class MaxSequenceOfIncreasingElements
{
    static void Main()
    {
        // Входа в масив
        int[] numbers = Console.ReadLine().Split().Select(int.Parse).ToArray();

        // Променлива, в която ще записваме най-дългата последователност от числа
        int bestLen = 0;
        // Променлива, в която ще запазваме от кой индекс започва най-дългата последователност от числа
        int index = 0;

        // Цилъл, с който обхождаме масива
        for (int i = 0; i < numbers.Length - 1; i++)
        {
            // Променлива за текущия брой последователни символи
            int currentLen = 0;
            // Две променливи, с който ще сравняваме двата елемента на масива
            int j = i;
            int k = i + 1;

            // Цикъл ако първия символ е по-малък от следващия
            while (numbers[j] < numbers[k])
            {
                // Увеличаваме текущата дължина и позициите в масива с 1
                currentLen++;
                j++;
                k++;

                // Ако втория символ е по-голям от дължината на масива прекратяваме цикъла
                if (k >= numbers.Length)
                {
                    break;
                }
            }

            // Ако текущия брой е по-голям от максималния до момента
            if (currentLen > bestLen)
            {
                // Максималния е равен на текущия
                bestLen = currentLen;
                // Записваме индекса, от който започва
                index = i;
            }
        }

        // Принтираме от индекса, от който започва най-дългата поредица от символи, до индеска от който започва + броя на символи
        for (int i = index; i <= index + bestLen; i++)
        {
            Console.Write("{0} ", numbers[i]);
        }
        Console.WriteLine();
    }
}